{"review_id":"ClgrKJ6dqiM7vSKJBJ2w6Q","user_id":"T5MGS0NHBCWgofZ6Q6Btng","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2013-06-03","text":"I've been here at least 5 times now and each time is better than the last. I Iove what they have done to improve the building and add outdoor dining. Service is always good here and on par with other top places in Mentor. I really suggest the chicken soup on a cold day it's very yummy! Everything I've had on the menu has been great.","useful":0,"funny":0,"cool":0}
{"review_id":"IBCTqmvwvd5ZqQhuvFDNXg","user_id":"NtkMuGqcis30GjAkq91etA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2014-03-15","text":"Terrific service. The place was packed, but we were seated right away. Chips and salsa on the table as we were seated. Great food, big portions, fast service.","useful":0,"funny":0,"cool":0}
{"review_id":"69kni-xG6qtg9y3Hq_zw5g","user_id":"unEY79t6hHECP9Yd58R1dg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2014-06-09","text":"Ate here for lunch on a Sunday.  Arrived around 12:30, and there were a decent number of customers seated.\n\nService was friendly and fast, food was excellent, and they have DRAFT BEER, including a couple of Mexican brews.\n\nThis location is the best Don Tequila I have been to.","useful":0,"funny":0,"cool":0}
{"review_id":"rQOasxLFCDNWLNW27VHnyA","user_id":"UwfgmOOul1fc79IcI5h2MQ","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2012-02-25","text":"Been dining here since it first opened. Wife is from tx so this is her taste of home. When tx folks come to visit they ask to go to Don's. \nIt's very good tex-mex.","useful":0,"funny":0,"cool":0}
{"review_id":"eGtRHSII_uNGVELSxjYNSA","user_id":"kqsBiDRm1u34Q0RqN62QIA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2014-03-15","text":"If you have a hankering for Mexican, head on over to don tequilas. Fast service and delicious food with generous portions. We ordered the Guadalajara special tamale and the pollo adobe and they were both delicious.","useful":0,"funny":0,"cool":0}
{"review_id":"O5UfgCBj4osaEeolc_muUA","user_id":"BYgAy3hu2s5GeiJ5WMuD0w","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2011-06-14","text":"Kind of disappointed with the previous reviews in the area of customer service because honestly there was none. We were the only patrons in the restaurant and the waiter seemed  inconvenienced by us being there. After he took our order he went and sat down in another booth and started playing on a computer. We did not get our food quickly like everyone else has said, as we were the only people here it shouldn't take as long as it takes for me to finish my beverage. Maybe it had something to do with the fact that the waiter was farting around instead of doing his job? They got three stars because despite the service the food was AMAZING and quite inexpensive. If you order a quesadilla you may want to order a la carte items as well because the quesadilla was the size of a large Taco which is odd.","useful":0,"funny":0,"cool":0}
{"review_id":"Dq7iR4uVsVWPfqKqaLtmtw","user_id":"iIZhrDYOmcyGdiWSWAldmw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2013-04-24","text":"I eat here all the time and most of the staff are from Guadalajara.... Food is definately \"americanized\" and by that i mean tamed down in heat and changed a little for what americans expect.... But when i order my racos de carne asada with lime and cilantro and onions.... All i get are big smiles and HOT sauce.... So if your in the mood for authentic hotmexican food.... Just let the waiter know.. Hell guide you to a great choice!","useful":0,"funny":0,"cool":0}
{"review_id":"0IOu6FA2x-rcvtXb8Xvheg","user_id":"Rt1sD4KdPD6Uquf9BIsw2Q","business_id":"dwQEZBFen2GdihLLfWeexA","stars":1,"date":"2012-12-10","text":"Always the same old bad Mexican food. At least this time I did not get the nearly 2 foot piece of hair in my Fajita Burrito.\nWhy many people I know, including my wife like to go to this place is beyond me.","useful":0,"funny":0,"cool":0}
{"review_id":"ysv7Ynllze9TV3GkzF0D3g","user_id":"xU3FI_O1XrjGRzOiFWvjBw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2015-09-07","text":"Very good, reasonable priced . The Texas quesadilla with chicken, \nSteak, shrimp, onion, peppers and cheese was large and very good\nThey have Dos Equis on draft!","useful":0,"funny":0,"cool":0}
{"review_id":"CwiGJRzxJ0wOfgmA4yCdig","user_id":"b7zWPM3MDi074PbSw9GSIA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2013-11-23","text":"What a surprise!  The most amazing Mexican food I have ever tasted and I am a foodie. My husband and I ordered the table side guac.  Delicious!   Texas margaritas. Delicious!  Seafood burritos with fresh cilantro!  I will be salivating for them soon!  All of the food was so fresh!  You must try this place. We will try the Green Road location next as it is closer to our home.","useful":0,"funny":0,"cool":0}
{"review_id":"DmVaJHiNO21faYMc74YegQ","user_id":"vUeijF36ja09bwzjUkoNpA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":2,"date":"2016-12-16","text":"Amazingly good Mexican food but they rip you off EVERY time.  They scratch your order on a piece of paper with no descriptions and prices never add up. Its ALWAYS more. We have checked this several tines and wrote down everything we ordered and the prices on the menu and its been 20-30% higher consistently every time.  Its too bad they scam their customers like this because the food really is awesome.  Write down everything you order and be prepared to question your bill.","useful":0,"funny":0,"cool":0}
{"review_id":"UR_LseKj5wZjLo-tCwwMIg","user_id":"ciFYbNSdhRpHW0LofmmeEQ","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2014-03-21","text":"We came here for the first time to celebrate my birthday.  We ate a ton of fresh chips in advance of the meal, the salsa was pretty mild.\n\nI had the Chori pollo, which is a burrito with chorizo and chicken with rice.  Man, it was amazing. Hot and spicy with peppers, I took some of the huge portion home and ate it the next day.  \n\nThe service was seriously, amazingly fast for a group of 4, and they kept our drinks regularly filled.","useful":1,"funny":0,"cool":0}
{"review_id":"5DOAfsOxp0zfhMjR2PdFgw","user_id":"mPfLvSeRYqdQxJQk5ANVUg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2013-03-20","text":"Yum!!! I love this place! Come almost every Friday. Try the Chicken Chili Verde, my first favorite dish. My new favorite, Burrito Chipotle!!!! So delicious! Don't forget the margaritas!! :)","useful":0,"funny":0,"cool":0}
{"review_id":"DTTZFF-izUvZbrmP_4b2Jg","user_id":"xevJes9a3TJOsuasqVpidA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2015-09-13","text":"We have just moved from Austin,TX to NE Ohio and are searching for our new favorite Mexican restaurant.  We were greeted promptly and brought to our table.  The chips were fresh and warm.  The salsa was a little blander than we care for.  Service seemed slow, but in all fairness it was Saturday evening.  I ordered the Lobster Enchiladas which had pieces of lobster sautéed with onion and tomato wrapped in a fresh corn tortilla.  It was average.  My husband had the Burrito Especial with a chicken burrito and a beef tip burrito.  Hubby said it was above average.  The rice had a nice flavor with an aftertaste of tomato and cilantro.  We were disappointed with the lack of complex flavor profiles that we have become accustomed to while living in the Southwest.  Overall, we rated it as adequate to good.","useful":0,"funny":0,"cool":0}
{"review_id":"loBnTqzypW71GSEsE8-R_g","user_id":"fGgE1ASXCWfuw5edGCfCFA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2015-01-14","text":"Maybe let's work on the chili rolenos. Do nice large poblemo peppers like el rancho and you got me as a frequent customer. A+ on the guacamole! Large portion. Nice!","useful":0,"funny":0,"cool":0}
{"review_id":"iDRXhARsx77_IpWhey58Gg","user_id":"9Y_HfxjyZU7ltQ3VY3Wj-A","business_id":"dwQEZBFen2GdihLLfWeexA","stars":1,"date":"2014-11-21","text":"The food isn't bad, but every time I come here with friends they overcharge us. We end up getting charged at least a few dollars more than our menu items should be when we check out, and it's happened on several different occasions. \n\nThough the food may have been good and reasonably priced (on the menu, not on the bill), we will unfortunately never be going back. Very disappointing.","useful":1,"funny":0,"cool":0}
{"review_id":"6sX7YcBhK0ASD8kLdVdCnw","user_id":"9CiRp71NmS_AP74rW-1gdg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2010-03-29","text":"First time I eat here I came with friends who told me the food was the most authentic Mexican food they ever had, well it was not for me since it's not really Mexican but Tex Mex really. It wasn't bad but nothing to write home about either, I ordered a piña colada and the waiter spill it over me without replacing it not good at all, the place tries so hard to be unique and as Mexican as can be but it is just a caricature and a stereotype of anything Mexican honestly I was waiting for the three amigos to come out of the bathroom or something I despise decoration like this  and it affected the overall rating. Second time there food was not as good I ordered a dish that included carnitas in it but they were missing I told my waiter he apologized brought them in told me he was sorry but he charged me for them anyways even though they were supposed to be included. Not as bad as others but not great by any means.","useful":1,"funny":0,"cool":0}
{"review_id":"SgUSVEETtE_HcBmeKAsN_w","user_id":"I7nW8TNt7h4Q6NnsJg3roA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2012-07-26","text":"Service is great. Food is texmex and very good. I wish they offered black beans, I'm from California where black beans are popular. Margaritas are great, I got a buzz from two. The place was busy. Mexican families were here  and that's a plus.","useful":1,"funny":0,"cool":0}
{"review_id":"mvThe_xt5r-nXwM4btoxeA","user_id":"xlp2qzyxgBg31wFHSDhKww","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2010-03-20","text":"With everywhere else packed on a Friday night, we wondered in, not expecting much quite honestly. \n\nWe both ordered off the specials menu, and my husband barely managed to squeeze in his standard 'where's my burrito' before two large plates, overflowing with food, arrived in front of us.\n\nThe food itself was good. Mexican food can too easily be greasy, but this was not. The menu is nothing startling, but the classic mexican dishes were all on the mark. And there was enough left over for a second meal tomorrow.\n\nPrices were very reasonable - our total bill, including tips, was less than $25.  Definitely planning another visit.","useful":3,"funny":0,"cool":2}
{"review_id":"SzI_v454Dd6HmxSi-wSZPw","user_id":"vkOWrnWgPhgpqev9ZanAnw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":2,"date":"2013-09-11","text":"i don't understand all of the high marks for the this place. the chips were not good and the salsa wasn't good either.. the chips were bland, old and not seasoned at all, the salsa represented canned tomato taste, yuk, the chix enchilada was flavorless, while using white meat chicken it was not seasoned and very chewy, it had no flavor whatsoever and was definitely something \"not\" to order. the  most off putting thing about the place is the filthiness of all the furniture and the fact that we had fruit flies buzzing our table thru out our meal. while el rodeo and el patron are nearby, and have far better food,i cant understand what the attraction is to this place, will not be back","useful":0,"funny":0,"cool":0}
{"review_id":"rwzyKNL1bA54asCoTGiQUA","user_id":"eyYzBULJ8uIi41drYCctuw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2010-08-22","text":"On a recent trip to Kirtland, OH.\n\nDecided to try even though the outside appearance was somewhat questionable.\n\nBut nice simple decor inside.  Friendly waitress who gave good tips from the menu.\n\nWe both had the Tres Amigos.  Nice chicken, steak, shrimp combo.","useful":0,"funny":0,"cool":0}
{"review_id":"1JgdQwRj4IrGaNfQIoxF1Q","user_id":"KQ-gI-xsZzq5xeHYev6eYg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2011-07-26","text":"If you blink. You will miss this little eatery, squished into the corner of a small strip mall in Mentor, Ohio.\n\nI went with a friend of mine from the area, who was treated like a rock star when he arrived (well, he IS a rock star), and that's indicative of the casual and familial vibe at this restaurant.  I didn't take notes - too busy enjoying the company - but I'm pretty sure I got a burrito and it was delicious.  Margaritas were excellent (this much I do remember) and service was quick and pleasant.  Now that I know that this place exists, it gives me even more reason to travel to the northern tip of Ohio for good company and eats!","useful":0,"funny":0,"cool":2}
{"review_id":"z6wG7RrcONWJlxE8AJypeg","user_id":"YBbNemmB8wWbKGr6V3bCAA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":1,"date":"2015-06-05","text":"This will probably be my last review of this location. I was at don tequila yesterday & the cashier was talking  to me but I couldn't understand so I laughed it off. \n    \nHe told me I looked sexy today and said something else. I said thanks and laughed so that he wouldn't be offended. He came around the counter and walked up on me then hugged me so I assume he was asking for a hug. \n    \nHe then whispered in my ear that he just wanted to feel my breast on his chest. Seriously....I don't feel like I need to wear jeans and sweaters in the summer because he is a pervert. \n\nIt was very disrespectful and unprofessional and I feel uncomfortable eating there anymore.","useful":1,"funny":2,"cool":0}
{"review_id":"NSBC7JSjUn3ru4vf3f21Dg","user_id":"CLHRQRNRrpj7Ht-oQSFf7g","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2014-04-04","text":"Sometimes you need a little spice in your life. Don Tequilla delivers. The neon sign beckons you inside and once there, sit back and enjoy.\n\nThe roomy booths offer space for cozy dinner or enough room for your whole brood or gang of friends. Nibble some fresh chips and salsa while you ponder your meal options. The salsa is fresh with tomatoes, cilantro and spice. In case that isn't enough heat for you ask for the special sauce from the kitchen for extra kick and spice.\n\nI ordered the chili rellenos hoping not to be disappointed - this gal spent some time in Arizona and loves her Mexican food. These didn't disappoint. Yum. Served with rice and beans with a drizzle of red sauce.\n\nGood enough to want to return and sample through the menu -- several other items caught my eye - fish tacos, nightly specials, burritos with tomatillo sauce!!! \n\nThe staff is friendly and patiently gives you time to check-out the menu and answer any questions. nom.nom.","useful":0,"funny":0,"cool":0}
{"review_id":"wPGXLAQX0z7FVh1PhInyLg","user_id":"MGBv4e-Z6lfyUcSVwPXQPA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2012-11-26","text":"i love this place!\n\nFirst impressions this place is a fun atmosphere filled with mexican clay rooftops and colorful furniture.  You get your chips and salsa as you sit down as usual while they take orders for drinks.  They got horchata here now, which is a + in my book, if you haven't tried it yet, i totally recommend to.  \n\nThe food came out rather fast and speedy on extremely hot plates.  The salsa and hot sauces there are bombbbbb. Ask them for homemade style hot sauces they make in the kitchen, it's different everytime you go in.  Some will leave you sweating and some will leave a sweet or an extra tomato flavor in your mouth.\n\nThe food i'd definitely rate 7.5\/10. as i'm a hardcore mexican food lover.  It's nothing you find in texas or california, but quite damn close.  I always find myself coming back to this fun filled, warm, family owned place and always leave feeling satisfied.  for taqueria style tacos, try the tacos el pastor!","useful":0,"funny":0,"cool":1}
{"review_id":"5oLdxF5fJfwrCZ20XDFDXg","user_id":"4pVwuNpFwn8nWrSkT0urvA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2016-01-01","text":"Authentic. Delicious chips and salsa follow you to the table on arrival - food arrives on plates too hot to touch. We lived in the South West for 9 years and ate at many Mexican places ONCE, before calling DonnyTs our favorite. We have been enjoying perfect food here for 6 plus years. Very little turn over in wait or kitchen staff... consistent quality food and service.","useful":0,"funny":0,"cool":0}
{"review_id":"BaqYuJH1oIMNayOBW_AqFw","user_id":"5z587IBRnjCbo51IaHNPzQ","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2010-08-18","text":"Why hello service. Don't let the lime green walls scare you, this place is all business. Seated immediately, the waiter came to the table immediately, and the food came almost immediately after we'd ordered. Boyfriend got a combo platter with an enchilada and taquito and devoured the whole thing. I got a carnitas dinner platter and I could only finish half since I filled up on chips and salsa and guacamole. It was so good! \n\nThe only disappointing part was the dessert. We ordered flan, and when it arrived it was covered in whipped cream and strawberry sauce which I am not a fan of. The consistency was nubbly. Should've went with the churros.","useful":1,"funny":0,"cool":1}
{"review_id":"0yqWd0USYSpaPI7zUW4JAw","user_id":"-S1dz92Q3RPfHomiqEeP8Q","business_id":"dwQEZBFen2GdihLLfWeexA","stars":1,"date":"2011-10-28","text":"Passed this place a few times and finally decided to try it. I got the #17 on the lunch menu. It was a burrito  with eggs, chorizo and cheese.  It was probably one of the most tasteless burritos I've ever had. It was covered in what appeared to be some sort of franks red hot sauce, and no im not mistaking it for enchilada sauce. The side of my plate was a pile of tomatoes shredded cheese and a piece of lettuce, a whole piece not shredded. Not happy with my lunch at all. The salsa and cheese dip were average, nothing to go crazy over. Service was quick and friendly. The food came out about 5 minutes after we ordered which kinda scared me. I like quick service, but also don't mind waiting a few minutes for some really good food. Overall the place was cute, people were friendly but food was less than OK. I wouldn't go back.","useful":0,"funny":0,"cool":0}
{"review_id":"pVpmE6BWfK6W-1Zvat94NQ","user_id":"ludX46lEfeQ8TuHsK0D9zw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2016-04-02","text":"This is our go to Mexican restaurant. The staff is kind and courteous and Javier is an amazing gentleman. Always prompt , fresh and delicious. Their mango margaritas and dos Equis pair perfectly with our meals. Very family friendly and great atmosphere. Really a great place","useful":0,"funny":0,"cool":0}
{"review_id":"d1y0PAqpOQ_Ml-xil4Pz6A","user_id":"rK2aGPWEU7UVwz_fqKE8mA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2012-09-12","text":"Food was AWESOME. The normal tacos are ... well ... normal and typical. My wife ordered the chicken fajitas and they were very good fajitas. I ordered the burrito durango which was a 12 inch shell STUFFED with chicken, steak, and huge shrimp! I asked for it spicy... and it actually came with pretty good heat. The burrito was outstanding, which is why I gave it 4 stars instead of 3. Overall, we'll probably be back.","useful":0,"funny":0,"cool":1}
{"review_id":"M8g0a_W1AcHxrOcyXG0paw","user_id":"3o2vT1qybhjpm_yChoLxlA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2016-09-17","text":"We had a really good meal here, service was quick and accurate.  Food was definitely better than most Mexican places around.  Margaritas were very good.  Most of all, the place was very clean!  Would definitely go again!","useful":1,"funny":1,"cool":1}
{"review_id":"3v3S0lYInTbqeN-lBh9VNA","user_id":"09jpZrKD_j0SG9WPBDSJQg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2014-06-25","text":"Went on a saturday night on the first night of summer, and had a party of 12.   We were sat almost immediately.  Went there because they had catered a party of a friend of mine.\n\nOur server was professional, and bilingual.  But you could totally understand him and had a cool accent.  Americanized i suppose.  They do not use a POS system but use an old paper check system...so separate checks becomes an issue.\n\nThey put tons of chips and salsa in front of you...the chips are super crunch but almost no salt, and the salsa was bland for my taste.\n\nI had the el paso speciai; beef tip burrito and chicken burrito w\/ rice and beans.  All came out hot but a little watery.  Dunno where that came from.  But I did ask for lettuce\/tomato set as it did not come with any in or on it.\n\nKids food came out fast, they did have the world cup and that seemed to distract the waiters...but as far as Mexican food goes it was pretty good for Mentor.","useful":0,"funny":0,"cool":0}
{"review_id":"bBkEPhdZhni_vzvTKFv-oA","user_id":"NvI6nkdKut_x5GommcngDw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2016-09-09","text":"Your basic traditional Mexican style restaurant, never at in only ordered out.\nMade me wait for a hand full of my orders when I came to pick it up..but super tasty. With a lot of hit and miss items in the menu.","useful":0,"funny":0,"cool":0}
{"review_id":"MjkZOjE7Wi5V7SjAhgcj-Q","user_id":"2rIHr_3qznLHn73YfOwkWA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2015-01-28","text":"Been here a couple times and so far every time we've gone the foods been great, the service has always been friendly and the portions are amazing!","useful":0,"funny":0,"cool":0}
{"review_id":"V-YiU3DC3prLkOh1ByOUAw","user_id":"Xxvz5g67eaCr3emnkY5M6w","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2017-07-04","text":"So, I thought the food was average. But what makes this place is the cool interior and super attentive and friendly bartenders and servers.  We felt like we were part of la familia. I haven't felt that way in a Mexican restaurant, probably ever.  Fajitas did not arrive sizzling. Bummer.  My bean burrito and cheese enchilada were standard fare. Nothing to shout about. The beer was extra cold so bueno for that.  Very clean restaurant.","useful":1,"funny":0,"cool":0}
{"review_id":"nLiRNtABmKq5-Vu2jsJQKg","user_id":"TQTMic2HzXjXmeMls5l0-g","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2012-12-02","text":"We've been going here several times a month ever since they opened. Some of the BEST Mexican food I've ever had at absolutely the LOWEST prices I have ever found for food this good. Waiters friendly and attentive. Nice decor. Nice new Bar.","useful":0,"funny":0,"cool":0}
{"review_id":"BLIJFaJZ-_fOcBs16fL_6g","user_id":"jgzD7eBwZrasqy6wUy122w","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-04-01","text":"Loved, Loved, Loved. It is a simple place, but you dont come to this place for the decor. You come for the damn good food. \n\nPlease note* I am just a customer. There is no dicount for posting nor any compensation for this rating.","useful":0,"funny":0,"cool":0}
{"review_id":"41ORR2OPi2CP0FAoiWjwWA","user_id":"60ENRcuFKNf9oeA2zWROFQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-07-16","text":"I  would've like to take a before picture when it looked all nice and pretty, but it was so delicious I just couldn't wait. I had the chicken chimichanga and my friend had of the chicken burrito supreme. I will never visit Robertos, Pepe's tacos, etc. again. #obsessed","useful":1,"funny":0,"cool":0}
{"review_id":"JGIVj26nGtLgzsL4zeaP2Q","user_id":"UKFgwgNM1a7Gmr0UIGPzpw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-06-12","text":"One of the few times I have given a business five stars. This restaurant has very good food everything on the menu is fresh and very very tasty. I've been to this restaurant probably 10 to 15 times and have never had a bad meal. Is the owner and staff of this restaurant are very nice and courteous and provide a good service and excellent food. I highly recommend this place for anything Mexican on their menu you will not be disappointed.","useful":1,"funny":0,"cool":1}
{"review_id":"w3ezGmzYbucBCNB66ilE4Q","user_id":"LnGDsxHFPhoCKT8sFGaViA","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":4,"date":"2015-08-01","text":"Las Vegas does not have a lot of good Mexican food unfortunately. So, when we do find one, it's always pretty exciting. This place was good. Reminded me a little of Texas, in terms of quality. \nEnchilada was very tasty, great sauce. Rice and beans were both delicious. Chile Relleno needed a tiny bit more flavor, but had plenty of cheese. Great little salsa bar. Had a bite of gf's Huevos Rancheros and we agreed that they were pretty awesome. We'll be back soon.","useful":4,"funny":1,"cool":2}
{"review_id":"wM9a-pB0MSnyIJ4eMmXBUw","user_id":"E1b2_YD1uwufHmCsrKteCw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-03-11","text":"Trying to curb my taco cravings, checked yelp for a taco spot not too far from the house, when I came across the review for Mi Pueblo Taco Shop and they have a perfect 5star rating. I haven't got my food yet, but the smell coming out the kitchen is amazing. It's a Friday night in Vegas, at a hole in the wall taco shop. The single file line is out the door.....Now that's a recipe for GREAT Mexican food","useful":0,"funny":0,"cool":0}
{"review_id":"fEpol5iWEiqKdbrIuHOc3A","user_id":"JoATwObKNywEmAduyKdm6w","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-07-22","text":"My daughter and I stopped in yesterday and truly enjoyed our meal. So much so we added an order to go. Just might have to give up my usual taco spot!!!! Food was great. My only critic no chips and salsa before the meal and only gives you a couple chips stuck in the great beans!!! Also might look into making up paper menus. Nothing to take home to read. The service impeccable. Will be back for sure.","useful":1,"funny":0,"cool":0}
{"review_id":"XgoMPW26QuJ6duS08QXc-g","user_id":"OVFCRSZ_yFEc1rAlye_Z5g","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2014-09-05","text":"Talk about authentic Mexican food!! there i was in search of a new place to eat close to work. I was craving authentic tacos, as i reminisced on my favorite taco shop in san francisco.\n      First stop was Cardenas. It was closer to me but the lines were ridiculous and the environment chaotic. Needless to say, i left in search of greener pastures. Second stop, the las vegas chain Rigos tacos. The place gave me a creepy vibe plus their soda machine was not working. I'm all for hole in the wall places but this place was too much. \n    As I drove aimlessly i came across this place, Mi pueblo Taco shop. Boy was I pleasantly surprised!! my  long search of a mom & pop taco shop proved fruitful. The lady at the counter and the cook turned out to be husband and wife, and the owners. They were both extremely friendly  and the food was delicious!! they had weird pricing quirks but hopefully they figure it out. overall, 5 stars and will definitely come back again.","useful":2,"funny":0,"cool":1}
{"review_id":"AL3myD9GD5Zj7YuVLq0N1w","user_id":"Jl-0N4zQ6VCbvk7DFpNfJg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-05-20","text":"I stop by here on my way to ed fountain park when my son has soccer games.  I usually get tacos and tamales for the team and they love them more than pepes.\nDefinitely a go to place for great Mexican food...cant wait to try other items.","useful":0,"funny":0,"cool":0}
{"review_id":"6EYXqTZHxfoZgA4gIrDVrQ","user_id":"C6ezDVKNyQz-aKr4OOjC4w","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":4,"date":"2017-05-12","text":"Very clean and friendly service. I had the Carne asada torta and my friend had tacos overall fairly good.  For a quick bite not bad.","useful":0,"funny":0,"cool":0}
{"review_id":"Eb3mICEEu0E8obitUjI8sA","user_id":"ozS37Fa6pFDEEMuqU3qmvg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-03-26","text":"Their food is delicious!!! I got Huevos Rancheros and my bf got menudo. He loved it! The lady at the register was friendly and super nice! The coffee is really good too!!","useful":0,"funny":0,"cool":0}
{"review_id":"LbwHTp9GEKk5xoQzIjITeg","user_id":"Rh2YtAmvRxDonUqZlxJDIw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-02-09","text":"Wonderful divey taco shop with awesome Mexican food. Highly recommend the tacos dorados, cheese enchiladas and chips with the salsa bar. The flavors are amazing! They must do most of their business as take out since it is so small, but the eating area is clean and nice. Don't be swayed by the strip mall. Definitely worth a stop.","useful":3,"funny":0,"cool":0}
{"review_id":"PM5aFLiwbKWDm_AtC71-3Q","user_id":"d9y5MjVOgxcP4Zc7qjowdA","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-11-03","text":"I walked in my scrubs and the owner asked me how I found out about his place.  I told him Yelp and that I was in the area for a school assignment and lived across town.  He never heard of Yelp and didnt know that his place has a 5 star rating.  He was wearing an SD cap and I found out he lived in San Diego.  If you ever had authentic San Diego Mexican food you know this place is legit, because it reminded me of that.  I found this to be a unique experience with genuinely nice restaurant owners not catering to Yelp reviewers.  Hopefully that won't change after my random stop there.\n\nI had a carnitas burrito, cachete taco and carne asada taco, and a horchata (no not Smart Chata).  Overall the carne asada was the most flavorful with a nice charred taste.  The cachete was tasty.  My carnitas burrito was good too, similar to the SD burritos I miss.  Tortilla, meat, rice, beans, and since I'm originally from San Francisco I added some sour cream with guacamole.  The salsa was also fresh and tasty.","useful":3,"funny":0,"cool":3}
{"review_id":"gonKSjSZrYkOzhdHBaCDeg","user_id":"vb9UuBS_qwUR-EGsJKlSFw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-10-20","text":"Great place if you want some traditional fresh Mexican food ! The over ceviche which is one of my favorite dishes, to to be honest it's one of the best ones I had !","useful":0,"funny":0,"cool":0}
{"review_id":"_dROxY7jxG8hH4eGOi6-nA","user_id":"IeVYKQZObeFnKTa04oB5Gg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-06-24","text":"They have tamarindo! My girlfriend and I have been looking for weeks and finally found our new go to spot!  Thanks!","useful":1,"funny":0,"cool":0}
{"review_id":"6SaVHkF1qwexY-nbGaxlPg","user_id":"6pzA8EDhHgW3A5-rBObhBA","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-07-05","text":"Craving for authentic Mexican Food and feeling adventurous and out of your comfort zone. Gotta try this humble and family operated place. Everything I had was simply delicious and would go out of my way to venture in this neighborhood for Tacos and Mexican food\n\nThe cashier\/server was very friendly and asked if it was my first time here. She answered my questions and made me feel welcomed. I originally was going to order Tacos only but the enchilada combo grab my attention and got the combo with a single order of Carne Asada Taco on the side because I had to get a taco too. \n\nWhen the order finally arrived at my table. I got the three different salsas that was available at the salsa bar. From the first bite of my taco and enchiladas 1-beef & 2-chicken combination along with the fresh salsas. Every bite was amazingly flavorful and authentic. The whole experience was great and felt like I was taking a short vacation in Mexico!","useful":4,"funny":1,"cool":2}
{"review_id":"FiNxxZQA_b6HEuTumHaEag","user_id":"Nym1l6I0gMFrr9WCAcMO0w","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2014-11-20","text":"Man this place is bomb dot com - \nLet me tell you when it comes to Mexican good I'm picky  there's so many spots here in vegas so when something really catches your taste buds then you know lol","useful":2,"funny":0,"cool":0}
{"review_id":"7NzfZCe-pdsY0oMJr17MZw","user_id":"2qLnlH24c6wdPn5XvG6DLg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-06-16","text":"We were in Vegas for a few days and after eating at a number of the expensive resort offerings we found this little diamond in the rough. This place ROCKS! Totally authentic mexican food. The tacos and flautas are legit and hit the spot dead on. We are mexican and we know our cuisine and you can't go wrong eating here. Just stop reading this review and try it. Like now.  Go!","useful":1,"funny":0,"cool":1}
{"review_id":"D26ZjupzxrjQHEt-wtCN7w","user_id":"WRWvu_McOkXguooZftZJmw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-05-05","text":"Yes its definitely a five star hidden gem. A great pit stop on the way to Moab. Everything was fresh right down to the rice. A nice older couple seem to run the restaurant. The prices are fair, it's probably not not in the best part of N. Vegas but worth trying out, we'll be back.","useful":0,"funny":0,"cool":0}
{"review_id":"onvMwlNZZjZ4mIz_2z7kvA","user_id":"Wt5mt4Byw5Mn3U41jUnCAQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-07-16","text":"MI Pueblo is the BEST TACO SHOP IN VEGAS.\nThe owners are so sweet and kind. Their food is absolutely delicious. I have had every single meal available here, and I NEVER once had anything that was bland or stale. They Cook everything fresh, despite what others think. Even though I'm guessing those people have never seen the cooks in action. This place is 1 IN A MILLION! I've been going since they've opened in 2008. I have never regretted going there. I ABSOLUTELY LOVE THIS PLACE AND THE OWNERS! It's such a shame when people check in on here to get free food and THEN POST NEGATIVE REVIEWS ABOUT THE FOOD THAT THEY ACTUALLY HAVE TO PAY FOR LOL. \nYOU WONT FIND MANY CLOSE TO HOME, DOWN TO EARTH AND DELICIOUS PLACES LIKE THIS.","useful":1,"funny":0,"cool":0}
{"review_id":"EgQjBwQ1cA0ymPZ-uYgGHw","user_id":"OMnGx8677VNH3-n3FGujYw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-01-03","text":"I haven't eaten yet but if it tastes half as good as it smells I'll be happy. The staff was super friendly thumbs up!!","useful":0,"funny":0,"cool":0}
{"review_id":"EEAdWv92XwDgFnJOmacXHA","user_id":"u5o_QDwRPQW8gjgFudu9bg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":4,"date":"2016-12-01","text":"Came here while visiting my friend in Vegas.  We wanted tacos and I'm picky about Mexican food.  This place totally hit the mark.  Not only was it delicious, the lady taking orders was super sweet and a really good salesperson.  I was debating on getting carne asada fries because i had already had fast food that day.  Here's how the convo went:\n\nHer: do you eat them [carne asada fries] every day?  \nMe: well, no...\nHer: then they're not so bad then\nMe: good point\n\nSalsa bar was on point and the spicy carrots and onions were crispy and super hot.  Yum.","useful":2,"funny":2,"cool":2}
{"review_id":"Z5bwRMa0dR_e5Pm_cz5zog","user_id":"zc6cucEAy6Qxkxr9ZUkqbw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":4,"date":"2016-10-14","text":"Once again. The good was hot and fresh tasty, the customer  service  is friendly  and personal. This what to expect from a family owned restaurant.   The burritos  are very nice sized \/over sized for your $$ the torta  is good also,  all the food is good sized portions","useful":1,"funny":0,"cool":0}
{"review_id":"LVRBgIK3CP5Ap__LlczgRg","user_id":"0Fhcuf1rKxSZOWQ4J56udw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-02-19","text":"This place is special. All their food is made with the care you would expect at a family gathering. The hospitality is incredible. This is NOT your typical Mexican turn-and-burn kind of place. Every dish I've ordered thus far has been absolutely fantastic...Well assembled and delicious. Personally, I love the \"caldo de pollo\" (chicken soup). I could eat it every day! This establishment is a definite winner in my book!!","useful":1,"funny":0,"cool":0}
{"review_id":"kC5ecZO35TPFuSV_H9poew","user_id":"qDdc-EvTGorahsfXnBYAEw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-05-19","text":"The food is very tasty, generous portions.  Had the combo with cheese enchilada, Carne Asada taco and chili rellenol with rice and beans.  Hubs had the Carne Asada plate .","useful":0,"funny":0,"cool":0}
{"review_id":"_SfOk_nyyitCBgZSEi6G_A","user_id":"VDjzt6N--TMXH4E7Y6ialQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-07-29","text":"I really enjoyed it here. The cheese enchiladas and carnitas taco were really good. The staff is very friendly, always nice to see positive happy people. I will be back for sure! give this place a try, you will enjoy it.","useful":2,"funny":0,"cool":1}
{"review_id":"bepPxZRTYhy4jWfWu_eCHg","user_id":"7JQsASQOgJAPuneUTxYZEg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-02-19","text":"This place is great! The food is amazing. Had a plate of chilaquiles and my wife had the machaca. The portions were generous and tasty. I highly recommend this place if you you in the area and want great Authentic Mexican Food!","useful":1,"funny":0,"cool":0}
{"review_id":"K9RjHW__5WqYMZDdkFsneA","user_id":"y74WFWeQHLCC9AbxuRWcSg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2014-10-30","text":"Outstanding. Visiting Las Vegas and happened upon this place. Having been raised in San Antonio, I feel like I know great Mexican food. And we found it here. The food is very authentic because they know how to build the meal with a great foundation. The chips and homemade tortillas are to die for. We all had various tacos, chicken and asada. Their burritos are huge!  The best part of the meal was the carnitas nachos. Don't miss out on them. When I'm back in vegas again, a meal here will be on my itinerary.","useful":2,"funny":0,"cool":1}
{"review_id":"2mEJoiRnFmlyJKe10lpi_w","user_id":"yvWZJA-h-UEC_Xf51eE0OQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-06-28","text":"Amazing, fresh and inexpensive! First time here and I love it.","useful":0,"funny":0,"cool":0}
{"review_id":"AQgNtmL_BZ1sNw0UsekBtw","user_id":"7vomvJjoNBthj7iVo1lFqg","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-02-15","text":"Was in town on a short layover and was looking for some real deal Mexican! This place was so good! The sopes were amazing!!!!!  Will definitely be back when in the area!","useful":1,"funny":0,"cool":0}
{"review_id":"Pmbh65APyWtZ2A9UNkNZfQ","user_id":"w7Q-WMxPuznP-P2Y79ICng","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2014-04-28","text":"Only 1 review?? C'mon! This place has awesome food!! It's rough around the edges but don't let it fool you. Tacos! Burritos! 3 different soups!","useful":3,"funny":1,"cool":1}
{"review_id":"Nyb_AnA1nP6u1uPQ2p_RNg","user_id":"vlcsGHaSPAS_Bb59EW6E8g","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-11-03","text":"Mi Pueblo Taco Shop is a family owned treasure in Las Vegas , Nevada.  Owners Juanita and Manuel make homemade Mexican food in small batches and treat E everyone like family.\n\nIt is outstanding.\n\nPaulette Motzko","useful":1,"funny":1,"cool":1}
{"review_id":"iHJQRpIvKhStGT6ruIaqQA","user_id":"yianVcvmHzUE08AVOz1iKw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-07-21","text":"This place is great. I come here almost every day. Today I had a California burrito which was incredible. The fish tacos are always delicious. I really enjoy coming here, the staff is nice and it's always clean.","useful":4,"funny":0,"cool":0}
{"review_id":"2z563U4pdgYWkYKfpYhhBg","user_id":"nx7twsWNlAMrsr1CBIW6AA","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-07-08","text":"Finally found the BEST Mexican restaurant in Las Vegas!! The food is not only fresh but comes in large quantities! Will come back again and will recommend this place to my family and friends!!","useful":0,"funny":0,"cool":0}
{"review_id":"ulzjicEUXoVff3d7VWzkeA","user_id":"nbVr7Q8j48hBODKrMOZdKQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2016-07-29","text":"Bomb! Fresh ingredients! \nYummy to my tummy! \nI would highly recommend this gem. This meal hit the spot, next time I'll try the enchiladas.....","useful":0,"funny":1,"cool":0}
{"review_id":"aWeHWmKbYRWbNh5_rSHd3Q","user_id":"ynaNvoqkUEm0Uoh06EltZQ","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2017-03-26","text":"Small mom and pop joint. Food is really good here and service is great, super friendly and welcoming.","useful":0,"funny":0,"cool":0}
{"review_id":"Sz7Q5Ylx6zeuxPqKx1Ohbw","user_id":"bmjZVlu-GdjK6f_c8FLNvw","business_id":"OQcvO5P3gH0cuJ-bPXwfQQ","stars":5,"date":"2015-12-05","text":"Very good I recommend the fish tacos!!! And carne asada tacos! All with red salsa!! Bomb!!!","useful":1,"funny":0,"cool":1}
{"review_id":"EfZfYyx7pN6e_xL1y1tNQA","user_id":"IXSTfBSe56Z0RvYg4Cfn2w","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":3,"date":"2015-02-23","text":"I like In and out burger.  The prices are reasonable.  the menu is simple. The burger is good. But I do have a problem with the massive lines and the seating. I assume that this is the way In and out burger is but I do not like to wait for a burger then have to scan the room for a dirty table that I have to wipe down myself.","useful":0,"funny":0,"cool":0}
{"review_id":"hN47f6bhfsfrenzgMp89hQ","user_id":"1KmCv57hyxZdtd_COuTZgA","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":5,"date":"2015-02-11","text":"Showed up here at 12:57 AM a few nights ago -- we were driving from Tucson to Los Angeles, and pulled off on a whim, hoping this location had hours to 1:30 or 2 AM.  The place looked open, but empty -- we pulled into the drive through, asked if they were still open, and received a very enthusiastic \"For three more minutes!\"  \n\nI felt bad about it, but the cashier was nice, and the fellow who handed us our burgers jokingly said that they were made with love.  It seems odd to say it, but he sounded genuinely sincere.  \n\nOrdered two cheeseburgers with extra everything, a double-double, and two fries.  Fries were piping hot \/ crispy, single burgers were heavily laden with at least 2.5 times the normal veggies -- unusually large for 'extra everything.'  \n\nI wouldn't normally leave a review for an In N Out, but everyone we spoke to was very nice, and they served us so close to closing.  Thank you!","useful":2,"funny":0,"cool":0}
{"review_id":"HHDTZDe054Lrp43TZqgocQ","user_id":"q9na5vXKRKJDjwWa-oR_bQ","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":3,"date":"2013-06-03","text":"It had been a while since I had been to an In N Out, and I figured I would give it another chance.  I've lived in California twice, and everyone there is obsessed with the place.  I can remember my first time visiting and thinking, meh, it's just ok.  So, I walked in to the Dysart location and stood in line for fifteen minutes and then waited ten more minutes for my food.  My opinion: meh.  Their fries are good, but their burger is nothing special.  Five Guys and Whataburger beat it hands down, every day of the week.  So next time I was hungry, that's exactly what I did....go across I10 and get something that I enjoy.","useful":1,"funny":0,"cool":1}
{"review_id":"IGCjBz13Wegjt-U50IFWzA","user_id":"wP4P1y7JoL98QD1D8Thx3g","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":5,"date":"2015-08-05","text":"Best place to get a protein burger and vanilla shake. The staff is always friendly but today our cashier Madison went above and beyond when my son was being cranky while I was trying  to order. She gave him stickers and a hat. Thanks for helping to calm him down.","useful":0,"funny":0,"cool":0}
{"review_id":"8mg7mjlhvQTCeBwiees9pQ","user_id":"VEO73s8YFuK9u4WO07mhfA","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":4,"date":"2010-07-09","text":"I've been to this place several times and the service is always friendly and fast. Orders were always correct. Prices are very reasonable. Only con is the limited menu, but hey, that's how they work so fast.","useful":0,"funny":0,"cool":0}
{"review_id":"bDen-skyfIgGbh08FvOilQ","user_id":"0DanBSoiQaytSeetNjw3fw","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":5,"date":"2008-08-14","text":"No matter where you go in the World if you are wearing an in and out shirt or hat some big guy usually yells out \"In and Out Man I love that place\" I think that says it all.","useful":2,"funny":0,"cool":2}
{"review_id":"1BVm6M5QecozwPnls4FntQ","user_id":"-cbmUZ_44245aoh5yo4ZOQ","business_id":"qU4wrOVqDfddr9PP_ssmUA","stars":4,"date":"2017-02-26","text":"Best low-carb burger in town.... Double Double with cheese protein style (wrapped in lettuce).","useful":0,"funny":0,"cool":0}
{"review_id":"FSUVv_zALancIFlqYcMGYA","user_id":"Y0QwHP4oxQ4jtk8R2PFq8g","business_id":"duHFBe87uNSXImQmvBh87Q","stars":5,"date":"2015-07-17","text":"My favorite stop. It is what you would expect all blimpie to be but unfortunately you can't expect this service or sandwich art at any other blimpie location. They are always generous with the condiments and veggies so much so I CRAVE these sandwiches. Always recommend to a friend.","useful":0,"funny":0,"cool":0}
{"review_id":"GbOPClhAFxRIS8XxySV36w","user_id":"F_g_b3vOcP80Q1hMWdqbxQ","business_id":"duHFBe87uNSXImQmvBh87Q","stars":5,"date":"2015-07-04","text":"This place is the best. They will make a sub to your liking and always, always exhibit a good vibe and attitude. Yeah it's just a sandwich shop but chit like that matters if you're ever going to have repeat business.","useful":0,"funny":0,"cool":1}
{"review_id":"jxYQ4LjL10rP2o93PWoKIg","user_id":"4W-ZU-E82HWWUNNk9tfN6g","business_id":"duHFBe87uNSXImQmvBh87Q","stars":5,"date":"2015-04-08","text":"I really like their bread.  Always soft inside and not too thick or hard on the outside.\n\nI like their fresh cut deli meats, but my favorite is always the TUNA, which is never soggy with mayo.  They do limit their toppings, but with great meat and bread all those toppings the competitors offer are not required.  \n\nThey're always friendly and quick and the owner\/manager is always there making sandwiches too.\n\nWhy buy a $10 sandwich at WholeFoods when you can get a better one at Blimpie's?","useful":3,"funny":1,"cool":2}
